Revit 2027 API
BuiltInFailures.CopyPasteFailures.CopingColumnBeamFailure Property
 The support order for a beam/column connection has been changed. When a beam is supported by a column that same beam cannot be coped by the column. The existing coping has been removed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CopingColumnBeamFailure { get; }
Public Shared ReadOnly Property CopingColumnBeamFailure As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CopingColumnBeamFailure {
	FailureDefinitionId^ get ();
}
static member CopingColumnBeamFailure : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CopyPasteFailures Class
Autodesk.Revit.DB Namespace